// Напишите программу, которая на вход принимает число и выдаёт его квадрат

Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
int sqr = number * number;
Console.WriteLine("Квадрат нашего числа = " + sqr);


